// i = 1;
// do {
//     console.log("i =", i)
//     i++
// }while(i < 5)

//--------------------------------------------

//ДЗ!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
// let numb = prompt("Введите число: ")
// let count = Number(numb)
// let i = 0;
// while (i < count){
//     console.log("#")
//     i++;
// }

//--------------------------------------------

// for(let i=0;i < 10;i++){
//     console.log("ДА")
// }

//--------------------------------------------

// while(true){
//     let nul = Number(prompt("Введите 0"))
//     console.log("Вы ввели: ", nul)
//     if (nul === 0)break;
// }
//-------------------------------------------------------

// for(let i = 1;i <= 5;i++){
//     console.log("Ряд №",i)
//     for(let j = 1;j <= 6;j++){
//         console.log("Место -",j)
//     }
//     console.log("---------------------------------------")
// }

//-----------------------------------------------------------------------

// let user ={
//     name: "Олег",
//     password: "11111",
//     group: 222,
// }

// for (let key in user){
//     console.log(key,":", user[key]) 
// }
//---------------------------------------------

// let numb = Number(prompt("Введите число: "))
// for(let i = 0; i <= numb;numb--){
//     console.log(numb)
// }

// let num = +prompt("Введите число") + место Number! ВАЖНО!!!!! 
//------------------------------------------------

